.cf.xml/InformationRegisters/обм_Измененные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>обм_Измененные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияДанных</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_ВерсияДанных</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияОтправителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОтправителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФлагОшибкиПриОбработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелОтправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_Измененные/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеДиалогом();
	
КонецПроцедуры

&НаКлиенте
Процедура КОтправке(Команда) 
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
		
	КонецЕсли; 

	источникСсылка = Элементы.Список.ТекущиеДанные.Ссылка;
	версияДанных = Элементы.Список.ТекущиеДанные.ВерсияДанных;
	узелОтправительИсточника = Элементы.Список.ТекущиеДанные.УзелОтправитель;
	удалитьРегистрацию = Команда.Имя <> "АдресацияКОтправкеБезУдаленияРегистрации";
	КОтправкеНаСервере(источникСсылка, версияДанных, узелОтправительИсточника, удалитьРегистрацию);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура КОтправкеНаСервере(пИсточникСсылка, пВерсияДанных, пУзелОтправительИсточника, пУдалитьРегистрацию)
	
	РегистрыСведений.обм_Измененные.КОтправке(
		пИсточникСсылка, пВерсияДанных, пУзелОтправительИсточника, пУдалитьРегистрацию);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогом()
	
	Если Элементы.Список.Видимость Тогда
		Элементы.Список.Обновить();
		
	КонецЕсли; 
	
	Если Элементы.ФормаПереключитьРегламентное.Видимость Тогда
		регламентное = Регламентное_Найти();
		
		заголовокКнопки = Неопределено;
		картинкаКнопки = Неопределено;
		Если регламентное.Использование Тогда
			заголовокКнопки = "Задание работает";
			картинкаКнопки = БиблиотекаКартинок.ОформлениеКругЗеленый;
			
		ИначеЕсли Не регламентное.Использование Тогда
			заголовокКнопки = "Задание отключено";
			картинкаКнопки = БиблиотекаКартинок.ОформлениеКругПустой;
			
		КонецЕсли;

		Элементы.ФормаПереключитьРегламентное.Заголовок = заголовокКнопки;
		Элементы.ФормаПереключитьРегламентное.Картинка = картинкаКнопки;
					
	КонецЕсли; 		

КонецПроцедуры

&НаСервере
Процедура ПереключитьРегламентноеНаСервере()
	
	регламентное = Регламентное_Найти();
	
	использование = регламентное.Использование;
	
	регламентное.Использование = Не использование;
	регламентное.Записать();
	
	УправлениеДиалогом();

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРегламентное(Команда)
	
	ПереключитьРегламентноеНаСервере();
	
КонецПроцедуры 

&НаСервере
Функция Регламентное_Найти()
	
	Возврат РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.обм_Отправка_1_ИсходящиеСообщения_Создать);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСписокОбработчиков(Команда)
	
	ОткрытьФорму("Справочник.общ_Обработчики.ФормаСписка");
	
КонецПроцедуры
